---
type: DefinitionGroups
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# DefinitionGroups

`Autodesk.Revit.DB.DefinitionGroups` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Contains | — | `public bool Contains ( DefinitionGroup definitionGroup )` |
| Method | Create | — | `public DefinitionGroup Create ( string name )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator < DefinitionGroup > GetEnumerator ()` |
| Property | IsEmpty | — | `public bool IsEmpty { get ; }` |
| Property | Item | — | `public DefinitionGroup this [ string groupName ] { get ; }` |
| Property | Size | — | `public int Size { get ; }` |